0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.9197;

boundaryField
{

    Inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    Outlet
    {
	type		zeroGradient;
    }

    Open
    {
	type		zeroGradient;
    }      

    Wall
    {
        type            omegaWallFunction;
        value           $internalField;
    }

}


// ************************************************************************* //
